---
title: Current me and Future me
author: Guo Te
date: '2022-07-21'
slug: current-me-and-future-me
categories:
  - daily
tags:
  - R Markdown
---

### 一个陷入深度自我怀疑的我

我从来没有遇到过，我陷入深度的抑郁状态，这种状态已经持续了2年多。  

这种自我怀疑的产生来自于自我的问话：
- 我之前学得那些认知到底是对的吗？
- 如果存在认知差距，那我能赶上来吗？
- 我是不是已经落后很多了。

### 一个从统计出发引发的思考

#### MS Excel
事情的发生都有个起因，我曾对**Excel**做linear regression感到神奇。像是打开了新的世界。没错那就是从蛋白标准曲线开始的。虽然现在尽量摆脱excel处理数据（非常容易出现拷贝错误和点按操作的繁琐），但我要坦白的说，这是我对统计认知开始的地方，对数据操作开始的地方。

#### Plot制图
制图，尤其是当代科学杂志和信息的传播性，不能否认这是一个读图的时代。最初的制图来自于**Origin**和**Graphpad Prism**。它们非常的方便且不需要用tidy data。当然接受便利的时候也要接受一个隐含的问题---这种制图是孤立的。它无法有机的结合原始数据，也无法独立的重现完全一致的图，但凡调整过一些元素的位置（图例，填充的pattern等等），它们无法形成一种程式化的语言记录，所以除了半残的工程文件，没法形成一个完整的有机体。此外对于稍微有一点自我定制需求的制图方案，比如加一个区域化的灰色背景，或者依据变量值改变元素的大小，颜色，动画等，这些看似方便的制图软件几乎没办法实现。此外就是图片的输出和排版。大量的时间浪费掉在这些图片的对其格式上，简直是灾难。


### 描述性研究到系统性认知

#### 一个幸运儿
不得不说这个世界的认知是严重的不平衡的。我从没有感到过如此担心，直到我读了博士之外，我才了解到发展的不平衡性。

我不想过多的谈论非自己能控制的因素，那些我们改变不了。比如我比大多数人幸运很多。我出生在一个教育环境不是最落后的地方。我不用为求学的资金发愁。我没有家里人带来的压力。我还幸运的被父母带到教育环境更好的（可以说是我们省当时数一数二的学校）。我遇到了好的老师。我没有遭遇什么重大的事故。我不想说个人的努力成分，但是我知道这一点虽重要，但绝对不是一个人仅靠努力就能改变其他因素所带来的影响。
要知道这些因素要附加在一起作用，我能做的很少，我只是一个幸运儿。故每个人只要有一个开放的胸怀，一心向学，这就让人佩服。接受那些不能改变的因素，努力做好自己能影响的因素。所以不要居高自傲，要想想今天的自己有多少是幸运的成分带来的影响，不能简单归因于自己的努力。

#### 主观的能动因素

**知识改变命运。** 一句脍炙人口的句子。我不知道人们对它是怎么理解的。知识可能很难在你迫切的需要一个面包，一瓶水的时候给你什么。知识是一种慢慢的累计。知识发挥的力量是一种量变到质变的过程。

**我能做的就是向比我见识认知广博的人求教。**
- 很幸运那些真正的**大家**写的书大多数都是公开获取的。
- 优秀的**学者**也把具有影响力的软件开源。
- 世界上优秀的**大学**也会开放自己的课程(**MOOC**)。
- **知识型自媒体的创作者**制作和奉献自己的知识(例如3B1B, StatRequest等等)。


### 一个需要面对现实的我
由于自我的否定，会产生一种强烈的怀疑，这种怀疑有人也称作imposter syndrome（冒名顶替症候群）。我想这种产生的原因一方面来自于自我的反思看到自己的不足，一方面来自于价值判断的缺失。怎么衡量自己的价值，很大程度上又来自社会认同感，社会认同又很荒诞。

当下我需要尽快毕业，找一份工作。我需要面包喝水，因为这是生命的基础，也是维持生命形态的必需品。我也不能活得太自私了，求学的路上什么都不管，什么都不考虑，除了工作和学习，还是应该回归一个生活中的人，喜怒哀乐，我还有家人。

### 展望

#### 梦想的种子
通过不断的自我问话和学习，具备了一定系统性思考的能力。也掌握了一定的逻辑思考能力。这些能力都是从统计上获得的。这些离不开 **Will Kurt**《Bayesian Statistics the Fun Way》，
**Richard McElreath**的书《Statistical Rethinking》，离不开**Alexandre ANDORRA**的[Podcast](https://learnbayesstats.com/)（他的法国口音很明显，有特色，英语语音还清晰，他的节目里有太多大家和不同于聒噪世界的声音。他本身是PyMC的成员）。

对记录和可重复性研究的实现方法离不开**谢益辉**的`Rmarkdown`和**Hadley Wickham**著名的`ggplot2`包。

未来的我：
- 掌握贝叶斯概率和统计推断
- 掌握概率编程来理解信号调控。（线性割裂的认知是有过多的假设和想当然因素的。先有了结果寻找证据的自洽性是违背真实自然规律的，就像照猫画虎一样，画成了大象然后说自己就是想画个大象）。
- 掌握Deepmind AlphaFold2的应用
- 掌握PyMol来对接小分子的空间结构

生物学过程不是一个完全随机事件。一个系统性的认知和**Uri Alon**的基元的理解应用是未来的方向。一个理性刻画的生物过程，将指导生物学认知和药物开发。

后记：
躲在屏幕后面，这个世界我能感受到的就是经历着高温，通过可能是唯一中文乌克兰战区的独立记者**王志安**的报道，画面里出现的是乌克兰广场上被俘获的俄罗斯坦克，电子干扰车。它们爆炸后被卷曲钢铁，乌克兰士兵的葬礼，教堂的钟声，哭泣的母亲，无助的阵亡者的妻子。。。一幕幕，什么都不用说，潸然泪下。太多的无辜的平民卷入世界政治的纷争，带来的是亲人永远的伤痛。

在脱去外界那些华丽的标签，战士，学者，著名大学，富豪，股票大亨，穷人，政治家。。。我们是别人的儿女，需要一口口的吃下每顿饭的人。**永远用一种建设性的思维来对待这个世界，而不是蓄意的破坏它。**



